from witch import Witch
from arena2 import Arena2
from mage import Mage
from assasin import Assasin
from archer import Archer
from varvar import Varvar
# Импорт функции рандом(случайный выбор объекта из списка)
import random

# Создал список бойцов
fighterPool = [Witch(), Mage(), Assasin(), Archer(), Varvar()]
# Рандомно выбирает бойца(каждая переменная)
# Что каждая переменная? Какая нахуй переменная? У тебя их чё много что ли блять. Вторая строчка кода нахуй, 
# а у тебя уже блять переменные нарисовались во множественном числе с одной явно объявленной, ну охуеть просто маг, я ебу 
f1 = random.choice(fighterPool)

# Делай по-пацански. Выноси это в метод для бойца
f1.isBusy = True # Флаг*- этот боец уже занят
print(f"Первый боец выбран: {f1.name}.")

# Пиздец как хуево ты читал документацию. Нейронка налепила говна тебе кучу целую, 
# хотя можно было и упростить в данной ситуации одним лишь методом pop. Открой и читай доку, ёбана. Головой тоже думать не забывай.
# Новый список где боец не занят т.е. isBusy = False
fighters = [fighter for fighter in fighterPool if not fighter.isBusy]
f2 = random.choice(fighters)
#Фактически уже похуй. Дальше нет никаких действий. Тем более, что ты не изменил статусную модель после результата функции startFight 
# Бойцы бой то уже закончили, и хули?
f2.isBusy = True 
print(f"Боец  {f1.name} уже занят (флаг активен). Выбираем другого из свободных.")
print(f"Второй боец выбран: {f2.name}.\n")
# Начать бой между переменными f1 и f2
Arena2(f1, f2).startFight()
